In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

DataFrame是一个矩形数据表，含有一组有序且有命名的列，每一列可以是不同类型。
DataFrame既有索引行也有索引列，可以看做由同一个索引的Series组成的字典。
虽然DataFrame是二维的，但可以用层次化索引可以表示更高维度的表格型数据。

In [4]:
#常用的创建DataFrame的方式：等长的列表或np数组构成的字典：
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
生成的DataFrame会自动加上索引，与Series一样，全部列都会按照data键（键的顺序取决于在字典里插入的顺序）的顺序有序排列，
在jupter里会生成友好地HTML表格，
对于特别大的DataFrame，head方法只会取前五行：

In [5]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [7]:
#tail会返回最后五行：
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
#如果指定了列的序列，则DataFrame的列就会按照指定顺序进行排列：
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [9]:
#如果字典不包含传入的列，就会在结果中产生缺失值：
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [10]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')